; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p3---int100n150-m25---int100c110---s5---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 - fuellevel
)

(:init
(sum level0 level9 level9)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level9 level10)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level9 level11)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level9 level12)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level9 level13)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level9 level14)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level9 level15)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level9 level16)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level9 level17)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level9 level18)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level9 level19)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level9 level20)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level9 level21)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level9 level22)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level9 level23)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level9 level24)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level9 level25)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level9 level26)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level9 level27)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level9 level28)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level9 level29)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level9 level30)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level9 level31)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level9 level32)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level9 level33)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level9 level34)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level9 level35)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level9 level36)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level9 level37)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level9 level38)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level9 level39)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level9 level40)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level9 level41)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level9 level42)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level9 level43)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level9 level44)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level9 level45)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level9 level46)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level9 level47)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level9 level48)
(sum level39 level24 level63)
(sum level40 level9 level49)
(sum level41 level9 level50)
(sum level42 level9 level51)
(sum level43 level9 level52)
(sum level44 level9 level53)
(sum level45 level9 level54)
(sum level46 level9 level55)
(sum level47 level9 level56)
(sum level48 level9 level57)
(sum level49 level9 level58)
(sum level50 level9 level59)
(sum level51 level9 level60)
(sum level52 level9 level61)
(sum level53 level9 level62)
(sum level54 level9 level63)

(connected l0 l1)
(fuelcost level24 l0 l1)
(connected l0 l2)
(fuelcost level9 l0 l2)
(connected l1 l0)
(fuelcost level24 l1 l0)
(connected l1 l2)
(fuelcost level25 l1 l2)
(connected l2 l0)
(fuelcost level9 l2 l0)
(connected l2 l1)
(fuelcost level25 l2 l1)

(at t0 l1)
(fuel t0 level63)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 3
2. (drive t0 l1 l0 level39 level24 level63)
   deleted: (at t0 l1) (fuel t0 level63)
   added: (at t0 l0) (fuel t0 level39)
   goals met: 0 of 3
3. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 1 of 3
4. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 3
5. (drive t0 l0 l2 level30 level9 level39)
   deleted: (at t0 l0) (fuel t0 level39)
   added: (at t0 l2) (fuel t0 level30)
   goals met: 1 of 3
6. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 1 of 3
7. (drive t0 l2 l1 level5 level25 level30)
   deleted: (at t0 l2) (fuel t0 level30)
   added: (at t0 l1) (fuel t0 level5)
   goals met: 1 of 3
8. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 3
9. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 3
